#### Terraform Plan ✅
```
module.talos.talos_machine_secrets.machine_secrets: Refreshing state... [id=machine_secrets]
module.talos.talos_image_factory_schematic.this: Refreshing state... [id=d4cf8602b9d285ede53209d5e8c482372d61d3b9aa850736c2dc65bd8d091cba]
module.talos.data.talos_client_configuration.talosconfig: Reading...
module.talos.data.talos_image_factory_urls.this: Reading...
module.talos.data.talos_machine_configuration.machineconfig_cp: Reading...
module.talos.data.talos_machine_configuration.machineconfig_worker: Reading...
module.talos.data.talos_image_factory_urls.this: Read complete after 0s
module.talos.data.talos_client_configuration.talosconfig: Read complete after 0s [id=cluster01]
module.proxmox.proxmox_virtual_environment_download_file.talos_nocloud_image: Refreshing state... [id=local:iso/talos-v1.11.5-nocloud-amd64.img]
module.talos.data.talos_machine_configuration.machineconfig_worker: Read complete after 0s [id=cluster01]
module.talos.data.talos_machine_configuration.machineconfig_cp: Read complete after 0s [id=cluster01]
module.proxmox.proxmox_virtual_environment_vm.talos_cp["talos-cp-01"]: Refreshing state... [id=101]
module.proxmox.proxmox_virtual_environment_vm.talos_workers["talos-worker-01"]: Refreshing state... [id=102]
module.talos.talos_machine_configuration_apply.worker_config_apply[0]: Refreshing state... [id=machine_configuration_apply]
module.talos.talos_machine_configuration_apply.cp_config_apply[0]: Refreshing state... [id=machine_configuration_apply]
module.talos.talos_machine_bootstrap.bootstrap: Refreshing state... [id=machine_bootstrap]
module.talos.talos_cluster_kubeconfig.kubeconfig: Refreshing state... [id=cluster01]
module.traefik.random_password.ubuntu_container_password: Refreshing state... [id=none]
module.traefik.tls_private_key.ubuntu_container_key: Refreshing state... [id=0940bdcfb1f2130a3129ccae2ec89db43fb78626]
module.traefik.proxmox_virtual_environment_download_file.latest_ubuntu_20_focal_lxc_img: Refreshing state... [id=local:vztmpl/ubuntu-20.04-standard_20.04-1_amd64.tar.gz]
module.proxmox_csi_plugin.proxmox_virtual_environment_role.csi: Refreshing state... [id=CSI]
module.monitoring.kubernetes_namespace.monitoring: Refreshing state... [id=monitoring]
module.sealed-secrets.helm_release.sealed_secrets: Refreshing state... [id=sealed-secrets-controller]
module.proxmox_csi_plugin.helm_release.proxmox_csi_plugin: Refreshing state... [id=proxmox-csi-plugin]
module.sealed-secrets.kubernetes_namespace.sealed-secrets: Refreshing state... [id=sealed-secrets]
module.proxmox_csi_plugin.kubernetes_namespace.csi-proxmox: Refreshing state... [id=csi-proxmox]
module.proxmox_csi_plugin.proxmox_virtual_environment_user.kubernetes-csi: Refreshing state... [id=kubernetes-csi@pve]
module.proxmox_csi_plugin.proxmox_virtual_environment_user_token.kubernetes-csi-token: Refreshing state... [id=kubernetes-csi@pve!csi]
module.sealed-secrets.kubernetes_secret.sealed-secrets-key: Refreshing state... [id=sealed-secrets/sealed-secrets-bootstrap-key]
module.proxmox_csi_plugin.kubernetes_secret.proxmox-csi-plugin: Refreshing state... [id=csi-proxmox/proxmox-csi-plugin]
module.traefik.proxmox_virtual_environment_container.traefik: Refreshing state... [id=108]
module.traefik.null_resource.traefik_config_sync: Refreshing state... [id=5270107476464041658]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.sealed-secrets.helm_release.sealed_secrets will be updated in-place
  ~ resource "helm_release" "sealed_secrets" {
      ~ id                         = "sealed-secrets-controller" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "0.31.0" -> (known after apply)
          ~ chart          = "sealed-secrets" -> (known after apply)
          ~ first_deployed = 1765216218 -> (known after apply)
          ~ last_deployed  = 1765216218 -> (known after apply)
          ~ name           = "sealed-secrets-controller" -> (known after apply)
          ~ namespace      = "sealed-secrets" -> (known after apply)
          ~ notes          = <<-EOT
                CHART NAME: sealed-secrets
                CHART VERSION: 2.5.19
                APP VERSION: 0.31.0
                
                ⚠ WARNING: Since August 28th, 2025, only a limited subset of images/charts are available for free.
                    Subscribe to Bitnami Secure Images to receive continued support and security updates.
                    More info at https://bitnami.com and https://github.com/bitnami/containers/issues/83267
                
                ** Please be patient while the chart is being deployed **
                
                Watch the SealedSecret controller status using the command:
                
                    kubectl get deploy -w --namespace sealed-secrets -l app.kubernetes.io/name=sealed-secrets,app.kubernetes.io/instance=sealed-secrets-controller
                
                Once the controller is up and ready, you should be able to create sealed secrets.
                
                1. Install the client-side tool (kubeseal) as explained in the docs below:
                
                    https://github.com/bitnami-labs/sealed-secrets#installation-from-source
                
                2. Create a sealed secret file running the command below:
                
                    kubectl create secret generic secret-name --dry-run=client --from-literal=foo=bar -o yaml |                     kubeseal                       --controller-name=sealed-secrets-controller                       --controller-namespace=sealed-secrets                       --format yaml > mysealedsecret.yaml
                
                The file mysealedsecret.yaml is a commitable file.
                
                If you would rather not need access to the cluster to generate the sealed secret you can run:
                
                    kubeseal                       --controller-name=sealed-secrets-controller                       --controller-namespace=sealed-secrets                       --format yaml > mysealedsecret.yaml
                
                to retrieve the public cert used for encryption and store it locally. You can then run 'kubeseal --cert mycert.pem' instead to use the local cert e.g.
                
                    kubectl create secret generic secret-name --dry-run=client --from-literal=foo=bar -o yaml |                     kubeseal                       --controller-name=sealed-secrets-controller                       --controller-namespace=sealed-secrets                       --format yaml --cert mycert.pem > mysealedsecret.yaml
                
                3. Apply the sealed secret:
                
                    kubectl create -f mysealedsecret.yaml
                
                Running 'kubectl get secret secret-name -o yaml' will show the decrypted secret that was generated from the sealed secret.
                
                Both the SealedSecret and generated Secret must have the same name and namespace.
            EOT -> (known after apply)
          ~ revision       = 1 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - keyrenewperiod = "8766h"
                  - namespace      = "sealed-secrets"
                  - resources      = {
                      - limits   = {
                          - cpu    = "100m"
                          - memory = "64Mi"
                        }
                      - requests = {
                          - cpu    = "10m"
                          - memory = "32Mi"
                        }
                    }
                }
            ) -> (known after apply)
          ~ version        = "2.5.19" -> (known after apply)
        } -> (known after apply)
        name                       = "sealed-secrets-controller"
      ~ version                    = "2.5.19" -> "2.18.1"
        # (29 unchanged attributes hidden)
    }

  # module.talos.data.talos_cluster_health.health will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "talos_cluster_health" "health" {
      + client_configuration = {
          + ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQakNCOGFBREFnRUNBaEJKRXY5aWVSbWtTVWlwejU1aUpJOXBNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5URXhNekF5TURVd01qUmFGdzB6TlRFeE1qZ3lNRFV3TWpSYU1CQXhEakFNQmdOVgpCQW9UQlhSaGJHOXpNQ293QlFZREsyVndBeUVBbDk1YnFvTlBQTnJIYlpWOXVqVmN6REVZelBaNG5BQU1tT1JFCmVvUGF5RTZqWVRCZk1BNEdBMVVkRHdFQi93UUVBd0lDaERBZEJnTlZIU1VFRmpBVUJnZ3JCZ0VGQlFjREFRWUkKS3dZQkJRVUhBd0l3RHdZRFZSMFRBUUgvQkFVd0F3RUIvekFkQmdOVkhRNEVGZ1FVbUFhLzN0bm8rejBRQVRDKwo5NGRKUCt0cXRNZ3dCUVlESzJWd0EwRUFLeEltQTlHY05uQnJaaEUvTVhrVjAzTWJ1Zkx4ZFJrZkpUbVF0RkVyCkFhcEhPVDZ2MjV1TzllQzBjQWk0VWZvbHVyOCtnUHdWOTN4QnFPK0RvL1JQQWc9PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
          + client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJoeHBlMkxHc0Uwc1FBVjhKZ0c3UktNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5URXhNekF5TURVd01qUmFGdzB5TmpFeE16QXlNRFV3TWpSYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQTk2c0tlb0dqbVRqck42eUh3SStSSjBUK3JOV1R2TnFpCkJKa2VjNWlKNzZLalNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCU1lCci9lMmVqN1BSQUJNTDczaDBrLzYycTB5REFGQmdNclpYQURRUUJacVNGRwpsOUt1M1g0bzVOeEdRRFNvL0EvWWsrS0lKKzkra2VjSitna3UrTzNvLzdPbk4xM2l5cWdEM0JLN081dDhGWHJICmVEMjZpQ3VZbnY3bE5pWUcKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
          + client_key         = (sensitive value)
        }
      + control_plane_nodes  = [
          + "192.168.1.210",
        ]
      + endpoints            = [
          + "192.168.1.210",
        ]
      + id                   = (known after apply)
      + timeouts             = {
          + read = "10m"
        }
      + worker_nodes         = [
          + "192.168.1.211",
        ]
    }

  # module.talos.talos_machine_configuration_apply.cp_config_apply[0] will be updated in-place
  ~ resource "talos_machine_configuration_apply" "cp_config_apply" {
        id                          = "machine_configuration_apply"
      ~ machine_configuration       = (sensitive value)
      ~ machine_configuration_input = (sensitive value)
      + resolved_apply_mode         = "auto"
        # (5 unchanged attributes hidden)
    }

  # module.talos.talos_machine_configuration_apply.worker_config_apply[0] will be updated in-place
  ~ resource "talos_machine_configuration_apply" "worker_config_apply" {
        id                          = "machine_configuration_apply"
      ~ machine_configuration       = (sensitive value)
      ~ machine_configuration_input = (sensitive value)
      + resolved_apply_mode         = "auto"
        # (5 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

Warning: Deprecated Resource

  with module.monitoring.kubernetes_namespace.monitoring,
  on modules/monitoring/main.tf line 2, in resource "kubernetes_namespace" "monitoring":
   2: resource "kubernetes_namespace" "monitoring" {

Deprecated; use kubernetes_namespace_v1.

(and 4 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
*Triggered by @renovate[bot]*